#include "common.h"
#include "bunyip.h"

// --- Local placeholder types ---

// RenderContext view (vtable at 0x12C, 68 slots)
#define VD(n) virtual UNK _v##n(UNK) = 0;

struct BunyipRenderer {
    /* 0x000 */ s32 flags;
    /* 0x004 */ u8 _pad[0x128];
    /* 0x12C = vptr */
    // clang-format off
    VD(1) VD(2) VD(3)
    virtual void vfunc4(PixelFormat* a, PixelFormat* b, s32 flag) = 0; // slot 4
    VD(5) VD(6) VD(7) VD(8) VD(9) VD(10)
    VD(11) VD(12) VD(13) VD(14) VD(15) VD(16) VD(17) VD(18) VD(19) VD(20)
    VD(21) VD(22) VD(23) VD(24) VD(25) VD(26) VD(27) VD(28) VD(29) VD(30)
    VD(31) VD(32) VD(33) VD(34) VD(35) VD(36) VD(37) VD(38) VD(39) VD(40)
    VD(41) VD(42) VD(43) VD(44) VD(45) VD(46) VD(47) VD(48) VD(49) VD(50)
    VD(51) VD(52) VD(53) VD(54) VD(55) VD(56) VD(57) VD(58) VD(59) VD(60)
    VD(61) VD(62) VD(63) VD(64) VD(65) VD(66) VD(67)
    virtual s32 vfunc68() = 0; // slot 68
    // clang-format on
};

#undef VD

// Large scene/world struct passed as arg2 to vfunc16
struct BunyipScene {
    /* 0x00 */ u8 pad00[0x40];
    /* 0x40 */ s32 unk40;
    /* 0x44 */ s32 unk44;
    /* 0x48 */ u8 pad48[4];
    /* 0x4C */ PixelFormat pixelFormat;
    /* 0x64 */ u8 pad64[0x38];
    /* 0x9C */ BunyipMark unk9C;
    /* 0xA0 */ u8 padA0[0x50C];
    /* 0x5AC = vptr */

    virtual UNK v1(UNK) = 0;
    virtual UNK v2(UNK) = 0;
    virtual UNK v3(UNK) = 0;
    virtual UNK v4(UNK) = 0;
    virtual UNK v5(UNK) = 0;
    virtual void vfunc6(Bunyip* self, s32 flag, BunyipMark* color) = 0;
};

extern "C" const BunyipMark D_80002430 = { { 0, 0, 0, 0 } };

void Bunyip::vfunc16(BunyipRenderer* ctx, BunyipScene* arg2) {
    PixelFormat pf1;
    PixelFormat pf2;

    pf1 = arg2->pixelFormat;

    if (ctx->vfunc68()) {
        flags |= 0x40;
    }

    u16 fl = flags;
    if ((fl & 0x20) && (ctx->flags & 0x200)) {
        flags = fl | 0x80;
    }

    ctx->vfunc4(&pf1, &pf2, flags & 0x20);

    s32 a40 = arg2->unk40;
    s32 a44 = arg2->unk44;
    vfunc14(ctx, &pf2, a40, a44);

    u16 fl2 = flags;
    if (fl2 & 0x20) {
        BunyipMark color;
        color = unk30;

        if (ctx->flags & 0x200) {
            arg2->unk9C = D_80002430;
        } else {
            arg2->unk9C = color;
        }

        arg2->vfunc6(this, flags & 0x4, &color);
    } else {
        arg2->vfunc6(this, fl2 & 0x4, NULL);
    }
}

Bunyip::Bunyip() {
    unk34 = 0;
    flags = 0;
}

void Bunyip::func_80029194(u16 val) {
    unk34 = val;
}

u16 Bunyip::func_8002919C() {
    return flags;
}

void Bunyip::func_800291A8(u16 val) {
    flags = val;
}

void Bunyip::func_800291B0(BunyipTrack* dst) {
    *dst = unk38;
}

void Bunyip::func_800291D8(BunyipTrack* src) {
    unk38 = *src;
}

void Bunyip::func_80029200(BunyipMark* dst) {
    *dst = unk30;
}

void Bunyip::func_80029218(BunyipMark* src) {
    unk30 = *src;
    unk30.data[3] = 0;
    flags |= 0x800;
}

u16 Bunyip::func_8002923C() {
    return flags & 0x1000;
}

u16 Bunyip::func_80029248() {
    return flags & 0x20;
}

u16 Bunyip::func_80029254() {
    return flags & 0x10;
}

u16 Bunyip::func_80029260() {
    return flags & 0x8;
}

u16 Bunyip::func_8002926C() {
    return flags & 0x200;
}

u16 Bunyip::func_80029278() {
    return flags & 0x100;
}

u16 Bunyip::func_80029284() {
    return flags & 0x4;
}

u16 Bunyip::func_80029290() {
    return flags & 0x2;
}

u16 Bunyip::func_8002929C() {
    return flags & 0x1;
}

u16 Bunyip::func_800292A8() {
    return unk34;
}

// vtable generated by compiler
